src/cf/src/Documents/КорректировкаДолга/КорректировкаДолга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КорректировкаДолга</name>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПокупателями</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСКонтрагентамиПрочие</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПоставщиками</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентДебитор</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентКредитор</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДебет</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаКредит</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧКредиторскаяЗадолженность</name>
    <attributes>
      <name>ОбъектРасчётов</name>
      <type>
        <types>DefinedType.ОбъектРасчётовОбщий</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧДебиторскаяЗадолженность</name>
    <attributes>
      <name>ОбъектРасчётов</name>
      <type>
        <types>DefinedType.ОбъектРасчётовОбщий</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/AccumulationRegisters/ВзаиморасчётыСПоставщиками/ВзаиморасчётыСПоставщиками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчётыСПоставщиками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаВВалюте</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРасчётов</name>
    <type>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.КорректировкаДолга</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ПоступлениеДополнительныхРасходов</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.НалоговаяНакладнаяПокупка</types>
      <types>DocumentRef.ПоступлениеИзПереработки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/Documents/КорректировкаДолга/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	РаботаСДокументами.ЗаполнитьРеквизитыПоУмолчанию(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	УстановитьПривилегированныйРежим(Истина);
	РаботаСДокументами.УстановитьЗаписьВсехРегистров(Движения);
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВЗ.ОбъектРасчётов КАК ОбъектРасчётов,
	                      |	ВЗ.Сумма КАК Сумма,
	                      |	Не ВЗ.СПоставщиком КАК СПокупателем,
	                      |	СПоставщиком КАК СПоставщиком
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		ДЗ.ОбъектРасчётов КАК ОбъектРасчётов,
	                      |		ДЗ.Сумма КАК Сумма,
	                      |		Истина как СПоставщиком
	                      |	ИЗ
	                      |		Документ.КорректировкаДолга.ТЧДебиторскаяЗадолженность КАК ДЗ
	                      |	ГДЕ
	                      |		ДЗ.Ссылка = &Док) КАК ВЗ
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВЗ.ОбъектРасчётов КАК ОбъектРасчётов,
	                      |	ВЗ.Сумма КАК Сумма,
	                      |	Не ВЗ.СПоставщиком КАК СПокупателем,
	                      |	СПоставщиком КАК СПоставщиком
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		КЗ.ОбъектРасчётов КАК ОбъектРасчётов,
	                      |		КЗ.Сумма КАК Сумма,
	                      |		Ложь как СПоставщиком
	                      |	ИЗ
	                      |		Документ.КорректировкаДолга.ТЧКредиторскаяЗадолженность КАК КЗ
	                      |	ГДЕ
	                      |		КЗ.Ссылка = &Док) КАК ВЗ");
	Запрос.УстановитьПараметр("Док", ЭтотОбъект.Ссылка);
    Рез = Запрос.ВыполнитьПакет();
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ТЗДебиторскаяЗадолженность", Рез[0].Выгрузить());
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ТЗКредиторскаяЗадолженность", Рез[1].Выгрузить());
	// Формируем движения
	//РегистрыНакопления.ВзаиморасчётыСКонтрагентамиПрочие.СформироватьДвижения(ЭтотОбъект);
	РегистрыНакопления.ВзаиморасчётыСПокупателями.СформироватьДвижения(ЭтотОбъект);
	РегистрыНакопления.ВзаиморасчётыСПоставщиками.СформироватьДвижения(ЭтотОбъект);
	//РегистрыНакопления.Продажи.СформироватьДвижения(ЭтотОбъект);
	Движения.Записать();
	ПроизводственныеЗаказы.ОбновитьСтадииПослеПроведения(ЭтотОбъект);
КонецПроцедуры

// Отмена проведения документа, затронувшего заказы клиента на производство: очистка движений и пересчёт стадий
// заказов (E8). Явных блокировок при проведении нет - и здесь нет. Без таких заказов движения удаляет платформа.
//
// Параметры:
//  Отказ - Булево - не используется.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	ПроизводственныеЗаказы.ОтменитьПроведениеДокумента(ЭтотОбъект, Неопределено);
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Ответственный = ПараметрыСеанса.Пользователь;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	РаботаСДокументами.МожноРедактироватьДокумент(ЭтотОбъект, Отказ);
	Если Не Отказ Тогда
		ПроизводственныеЗаказы.ЗапомнитьЗаказыДокумента(ЭтотОбъект, РежимЗаписи);
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	// Проведённый документ, перезаписанный без перепроведения, пересчитывает стадии своих заказов (E8).
	ПроизводственныеЗаказы.ОбновитьСтадииПриЗаписи(ЭтотОбъект);
КонецПроцедуры
